mrsgit09Docset0516221715/articles/MS-SSAS/e1360272-5808-4759-a2a1-66e82a157d5c.md

<html dir="LTR" xmlns:mshelp="http://msdn.microsoft.com/mshelp" xmlns:ddue="http://ddue.schemas.microsoft.com/authoring/2003/5" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:tool="http://www.microsoft.com/tooltip">
    <head>
        <meta http-equiv="Content-Type" content="text/html; CHARSET=utf-8"></meta>
        <meta name="save" content="history"></meta>
        <title>4.2.3 Request for List of Cubes</title>
        <xml>
            <mshelp:toctitle title="4.2.3 Request for List of Cubes"></mshelp:toctitle>
            <mshelp:rltitle title="[MS-SSAS]: Request for List of Cubes"></mshelp:rltitle>
            <mshelp:keyword index="A" term="e1360272-5808-4759-a2a1-66e82a157d5c"></mshelp:keyword>
            <mshelp:attr name="DCSext.ContentType" value="open specification"></mshelp:attr>
            <mshelp:attr name="AssetID" value="e1360272-5808-4759-a2a1-66e82a157d5c"></mshelp:attr>
            <mshelp:attr name="TopicType" value="kbRef"></mshelp:attr>
            <mshelp:attr name="DCSext.Title" value="[MS-SSAS]: Request for List of Cubes" />
        </xml>
    </head>
    <body>
        <div id="header">
            <h1 class="heading">4.2.3 Request for List of Cubes</h1>
        </div>
        <div id="mainSection">
            <div id="mainBody">
                <div id="allHistory" class="saveHistory"></div>
                <div id="sectionSection0" class="section" name="collapseableSection">
                    

<p>The client sends a header for an <b>MDSCHEMA_CUBES</b>
request:</p>

<dl>
<dd>
<div><pre> POST /as/msmdpump.dll HTTP/1.1
 User-Agent: XmlaClient
 Content-Type: text/xml
 SOAPAction: &quot;urn:schemas-microsoft-com:xml-analysis:Discover&quot;
 X-Transport-Caps-Negotiation-Flags: 1,0,0,0,0
 Host: testserver:2390
 Content-Length: 571
 Expect: 100-continue
</pre></div>
</dd></dl>

<p>The server responds with a confirmation:</p>

<dl>
<dd>
<div><pre> HTTP/1.1 100 Continue
</pre></div>
</dd></dl>

<p>The client sends the payload portion of the request:</p>

<dl>
<dd>
<div><pre> &lt;Envelope xmlns=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
   &lt;Header&gt;
     &lt;XA:Session soap:mustUnderstand=&quot;1&quot; SessionId=&quot;537C61C6-827C-4305-83A6-C8CE4A91001B&quot; xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:XA=&quot;urn:schemas-microsoft-com:xml-analysis&quot; /&gt;
   &lt;/Header&gt;
   &lt;Body&gt;
     &lt;Discover xmlns=&quot;urn:schemas-microsoft-com:xml-analysis&quot;&gt;
       &lt;RequestType&gt;MDSCHEMA_CUBES&lt;/RequestType&gt;
       &lt;Restrictions&gt;&lt;/Restrictions&gt;
       &lt;Properties&gt;&lt;PropertyList&gt;&lt;Content&gt;Data&lt;/Content&gt;&lt;/PropertyList&gt;&lt;/Properties&gt;
     &lt;/Discover&gt;
   &lt;/Body&gt;
 &lt;/Envelope&gt;
</pre></div>
</dd></dl>

<p>The server responds with an empty list of cubes:</p>

<dl>
<dd>
<div><pre> HTTP/1.1 200 OK
 Date: Sat, 16 Feb 2008 00:30:34 GMT
 Server: Microsoft-IIS/6.0
 X-Powered-By: ASP.NET
 Transfer-Encoding: chunked
 X-Transport-Caps-Negotiation-Flags: 0,0,0,0,0
 Content-Type: text/xml
 208
 &lt;soap:Envelope xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
   &lt;soap:Body&gt;
     &lt;DiscoverResponse xmlns=&quot;urn:schemas-microsoft-com:xml-analysis&quot; xmlns:ddl2=&quot;http://schemas.microsoft.com/analysisservices/2003/engine/2&quot; xmlns:ddl2_2=&quot;http://schemas.microsoft.com/analysisservices/2003/engine/2/2&quot;&gt;
       &lt;return&gt;
         &lt;root xmlns=&quot;urn:schemas-microsoft-com:xml-analysis:rowset&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;/&gt;
       &lt;/return&gt;
     &lt;/DiscoverResponse&gt;
   &lt;/soap:Body&gt;
 &lt;/soap:Envelope&gt;
 0
</pre></div>
</dd></dl>


                </div>
            </div>
        </div>
    </body>
</html>